const ru = {
    mainPage: {
        mainTitle: 'Обо мне',
        cookies: 'DoubleCookies',
        programmingTitle: 'Программирование',
        programmingIntro: 'Моё основное занятие. Java-разработчик с 4 годами опыта работы; ' +
            'знаком с Spring Boot, JUnit, БД (SQL и NoSQL), также использовал JS (React, Typescript), HTML и CSS. ' +
            'Принимал участие как в создании нового масштабного проекта, так и в доработке ряда уже существующих.',
        programmingOpenSource: 'Иногда вношу вклад в Open Source — на GitHub работаю над своими проектами и немного помогаю другим.',
        programmingLink: 'Больше о программировании',
        fandomTitle: 'FANDOM',
        hobbiesTitle: 'Увлечения',
        hobbiesLink: 'Больше о хобби',
        intro: 'Привет! Меня зовут <1>Игорь</1>, но кто-то знает меня как <1>DoubleCookies</1> — тот, кто любит программировать, кушать печенье, изучать статистику и не только!',
    },
    aboutBlock: {
        Java: "Старший Java-разработчик, почти 5 лет опыта работы",
        Skills: "Знаком с Java, Spring Boot, Maven, JavaScript, TypeScript, React, HTML, CSS",
        Project: "Принимал участие как и в создании нового проекта, так и в доработке старых",
        TeamManagement: "Помогаю другим разработчикам в команде",
        OpenSource: "Вношу свой вклад в Open Source - на GitHub работаю над своими проектами и немного помогаю другим",
        Hobbies: "Увлекаюсь шахматами, фотографией и другими интересными вещами!",
        SplatoonStart: "Активный член Splatoon-коммьюнити - принимаю активное участие в организации событий и в другой " +
            "деятельности в рамках сообщества",
        SplatoonFin: "Также являюсь лидером Splatoon команды Ewfish (также известной как ФУРЫБА) - одной из немногих" +
            "ру-команд, принимающих участие в международных турнирах",
    },
    aboutThisPage: {
        title: 'Эта страница написана с использованием следующих технологий:',
        antd: 'Для множества компонентов (меню, изображения, даже это всплывающее окно)',
        createReactApp: 'Стартовая точка создания',
        ghPages: 'Место размещение web-страницы',
        i18next: 'Для поддержки разных языков',
        reactRouter: 'Для навигации',
        cookie: 'Я умное печенье. Что-то знаю про всё это.'
    },
    programmingProject: {
        title: 'Проекты',

        mention: 'Другие *ничего так* проекты',
        mentionProjects: 'И ещё несколько проектов, достойные упоминания:',
        GDStatistics: 'Проект, посвящённый сбору статистики из игры Geometry Dash.',
        stats4wiki: 'Похож на предыдущий проект, но более узконаправленный.',
        wikiWamLog: 'Графики рейтинга WAM для нескольких википроектов',
        StringSwap: 'Небольшое приложение для работы с текстом',
        AssociativeRules: 'Старый проект, созданный ещё в университете. Позволяет произвести анализ ассоциативных правил в рамках задачи медицинской диагностики.',

        favorite: 'Любимые проекты',
        favoriteDescription: 'Список проектов на Github\'е не <1>прям чтобы большой</1>, ' +
            'но в нём отдельно хочется выделить следующие:',
        MazeGeneratorAndSolver: 'Один из старых проектов, который был создан ради развлечения, и в итоге он запал в душу всерьёз и надолго.' +
            ' Любовь к лабиринтам + визуализация + всякие фичи = <1>❤</1>',
        'wat-increment': 'Пусть он и незавершён, но тем не менее мне очень нравится тема <1>хаоса</1> в Javascript, за которым скрывается <1>порядок</1>',
        inDevelopment: 'То, что в разработке.',
        inDevelopmentDescription: 'Стоять на месте - не лучшая идея, так что в будущих проектах ' +
            'планирую делать новые, полезные и, надеюсь, <1>прикольные</1> вещи',
    },
    programmingSection: {
        exp: 'Навыки',
        link: "На моей <1>GitHub-странице</1> находятся ряд репозиториев с проектами. Вот некоторые из них:",
        start: 'Разработкой программного обеспечения занимаюсь на протяжении уже более трёх лет. За это время успел познакомиться и использовать следующие технологии:',
        javaExp: '"Основной" язык, на котором программирую большую часть времени. За это время познакомился со следующими технологиями:',
        jsExp: 'Javascript и прочие связанные с ним вещи. Также активно использую.',
        otherExp: 'Прочее',
        githubStats: 'Статистика на GitHub',
    },
    hobbiesSection: {
        photoTitle: 'Фотография',
        photoStart: 'В свободное время люблю фотографировать природу (в основном в пределах города), но иногда и экспериментирую с натюрмортами. ' +
            'Начал увлекаться этим в университете, нравится до сих пор.',
        photoGallery: 'Ниже можно увидеть некоторые мои фотографии:',
        fandomTitle: 'FANDOM',
        fandomStart: 'FANDOM — это один из крупнейших вики-хостингов и сайтов для фанатов. Активно редактирую на нём начиная с ' +
            '2016 года. Основным направлением является поддержание технической части википроектов (шаблоны, CSS, JS, в редких случаях — Lua); помимо этого ' +
            'дорабатываю имеющиеся статьи и иногда создаю новые.',
        fandomVanguard: 'С 2019 по 2022 являлся членом команды Vanguard, которая делала контент ФЭНДОМа доступным для как можно большего количества устройств. Сейчас ' +
            'этот проект закрыт, но воспоминания о себе он оставил позитивные.',
        chessTitle: 'Шахматы',
        chessStart: 'Впервые познакомился с ними в 4 года (шахматы, конечно, сложнее машинок и роботов, но куда интереснее). ' +
            'Принимал участие в школьных и университетских соревнованиях, есть занимал 1-3 места в составах команд. ' +
            'Сейчас играю не так часто, в основном – онлайн.',
        splatoonInfo: 'Splatoon – добрая и увлекательная игра про кальмаров и осьминогов, которые красят территории и плюхают друг друга. ' +
            'Ярко, весело, динамично, <0>спустя 10000 лет после апокалипсиса, не стоит слишком глубоко лезть в лор</0>. С игрой ' +
            'познакомился в 2018 году – сначала как зритель (видел финал чемпионата мира), а спустя некоторое время – и как игрок. \n' +
            'Со временем всё больше и больше вливался в сообщество игры и в начале 2021 года уже принимал участие в организации ' +
            'различных событий в ру-сегменте - турниров, сплатфестов, был даже показ мод (почему бы и нет, в игре >300 видов одежды). \n' +
            'Параллельно с этим в 2020 году вступил в команду Ewfish (она же ФУРЫБА) – сначала в качестве просто участника, однако ' +
            'со временем добрался до роли лидера благодаря высокой активности и поиску новых членов команды. Нам довелось принимать ' +
            'участие как и в ру-турнирах (где мы почти всё время останавливались недалеко от призовых мест, уступая более опытным ' +
            'игрокам), так и в международных турнирах – в итоге мы неоднократно занимали призовые места в турнирах для команд ' +
            '"начального" уровня.\n' +
            'Уже совсем скоро выйдет Splatoon 3 – и кто знает, что будет ждать и меня, и ФУРЫБУ дальше. Надеюсь, что будет интересно, ' +
            'увлекательно и весело для всех нас!'
    }
}

export default ru;